#+TITLE: TODOs example

This is an example of an automatically updating org file.  When a user
modifies start or end times and commits a file an action detects the
change and runs org mode table update function which updates the hours
field and the total sum.

| Start time | End time | Activity | Hours |
|------------+----------+----------+-------|
|         03 |       07 | App dev  |     4 |
|         09 |       12 | App dev  |     3 |
|         13 |       15 | Course   |     2 |
|         15 |       17 | Atlas    |     2 |
|         11 |       18 | Daily    |     7 |
|         10 |       12 | Daily    |     2 |
|------------+----------+----------+-------|
|      Total |          |          |    20 |
#+TBLFM: @>$4=vsum(@2$4..@>>$4)::$4=($2 - $1)

In Emacs this can be done manually by placing a point on the =TBLFM=
instruction and using =C-c C-c= or, just like the action does it,
running =org-table-iterate-buffer-tables=.
